# About Dataset

## Bank Customer Segmentation
Most banks have a large customer base - with different characteristics in terms of age, income, values lifestyle, and more. Customer segmentation is the process of dividing a customer dataset into specific groups based on shared traits.

According to a report from Ernst & Young, â€œA more granular understanding of consumers is no longer nice-to-have item, but a strategic and competitive imperative for banking providers. Customer understanding should be a living, breathing part of everyday business, with insights underpinning the full range of banking operations.

## About this Dataset
This dataset consists of 1 Million+ transaction by over 800K customers for a bank in India. The data contains information such as - customer age (DOB), location, gender, account balance at the time of the transaction, transaction details, transaction amount, etc.

Link: https://www.kaggle.com/datasets/shivamb/bank-customer-segmentation/code?datasetId=1672910&sortBy=voteCount

## Interesting Analysis Ideas
The dataset can be used for different analysis, example -

1. Perform Clustering / Segmentation on the dataset and identify popular customer groups along with their definitions/rules
2. Perform Location-wise analysis to identify regional trends in India
3. Perform transaction-related analysis to identify interesting trends that can be used by a bank to improve / optimize their user experiences
4. Customer Recency, Frequency, Monetary analysis
5. Network analysis or Graph analysis of customer data.

# EDA

## Import required modules

In [115]:
import numpy as np
import pandas as pd
import seaborn
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

## Import and display the data

In [116]:
df = pd.read_csv('data/bank_transactions.csv')
df.head(20)

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.00
1,T2,C2142763,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.00
2,T3,C4417068,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.00
3,T4,C5342380,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.00
4,T5,C9031234,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.50
5,T6,C1536588,8/10/72,F,ITANAGAR,53609.20,2/8/16,173940,676.00
6,T7,C7126560,26/1/92,F,MUMBAI,973.46,2/8/16,173806,566.00
7,T8,C1220223,27/1/82,M,MUMBAI,95075.54,2/8/16,170537,148.00
8,T9,C8536061,19/4/88,F,GURGAON,14906.96,2/8/16,192825,833.00
9,T10,C6638934,22/6/84,M,MUMBAI,4279.22,2/8/16,192446,289.11
10,T11,C5430833,22/7/82,M,MOHALI,48429.49,2/8/16,204133,259.00
11,T12,C6939838,7/7/88,M,GUNTUR,14613.46,2/8/16,205108,202.00
12,T13,C6339347,13/6/78,M,AHMEDABAD,32274.78,2/8/16,203834,12300.00
13,T14,C8327851,5/1/92,F,THANE,59950.44,1/8/16,84706,50.00
14,T15,C7917151,24/3/78,M,PUNE,10100.84,1/8/16,82253,338.00
15,T16,C8334633,10/7/68,F,NEW DELHI,1283.12,1/8/16,125725,250.00
16,T17,C1376215,1/1/1800,M,MUMBAI,77495.15,1/8/16,124727,1423.11
17,T18,C8967349,16/7/89,M,MUMBAI,2177.85,1/8/16,124734,54.00
18,T19,C3732016,11/1/91,M,MUMBAI,32816.17,1/8/16,122135,315.00
19,T20,C8999019,24/6/85,M,PUNE,10643.50,1/8/16,152821,945.00

## Data Checks to perform
Check Missing values
Check Duplicates
Check data type
Check the number of unique values of each column
Check statistics of data set
Check various categories present in the different categorical column

## Missing Values

In [117]:
df.shape

(1048567, 9)

In [118]:
df.isna().sum()

TransactionID                 0
CustomerID                    0
CustomerDOB                3397
CustGender                 1100
CustLocation                151
CustAccountBalance         2369
TransactionDate               0
TransactionTime               0
TransactionAmount (INR)       0
dtype: int64

In [119]:
df.dropna(inplace=True)

In [120]:
df.isna().sum()

TransactionID              0
CustomerID                 0
CustomerDOB                0
CustGender                 0
CustLocation               0
CustAccountBalance         0
TransactionDate            0
TransactionTime            0
TransactionAmount (INR)    0
dtype: int64

## Check duplicates

In [121]:
df.duplicated().sum()

0

## Check Datatypes

In [122]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1041614 entries, 0 to 1048566
Data columns (total 9 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   TransactionID            1041614 non-null  object
 1   CustomerID               1041614 non-null  object
 2   CustomerDOB              1041614 non-null  object
 3   CustGender               1041614 non-null  object
 4   CustLocation             1041614 non-null  object
 5   CustAccountBalance       1041614 non-null  float64
 6   TransactionDate          1041614 non-null  object
 7   TransactionTime          1041614 non-null  int64
 8   TransactionAmount (INR)  1041614 non-null  float64
dtypes: float64(2), int64(1), object(6)
memory usage: 79.5+ MB

## Check Unique Values

In [123]:
df.nunique()

TransactionID              1041614
CustomerID                  879358
CustomerDOB                  17233
CustGender                       3
CustLocation                  9275
CustAccountBalance          160723
TransactionDate                 55
TransactionTime              81855
TransactionAmount (INR)      92391
dtype: int64

## Statistics

In [124]:
df.describe()

       CustAccountBalance  TransactionTime  TransactionAmount (INR)
count        1.041614e+06     1.041614e+06             1.041614e+06
mean         1.149986e+05     1.571221e+05             1.566096e+03
std          8.467609e+05     5.126352e+04             6.561464e+03
min          0.000000e+00     0.000000e+00             0.000000e+00
25%          4.728140e+03     1.240410e+05             1.600000e+02
50%          1.676852e+04     1.642470e+05             4.575000e+02
75%          5.742885e+04     2.000220e+05             1.200000e+03
max          1.150355e+08     2.359590e+05             1.560035e+06

## Cleaning

## change dob and transaction date dtypes

In [125]:
df['CustomerDOB'] = pd.to_datetime(df['CustomerDOB'])
df['TransactionDate'] = pd.to_datetime(df['TransactionDate'])
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,143207,25.0
1,T2,C2142763,2057-04-04,M,JHAJJAR,2270.69,2016-02-08,141858,27999.0
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-02-08,142712,459.0
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,2016-02-08,142714,2060.0
4,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,2016-02-08,181156,1762.5

In [126]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1041614 entries, 0 to 1048566
Data columns (total 9 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   TransactionID            1041614 non-null  object
 1   CustomerID               1041614 non-null  object
 2   CustomerDOB              1041614 non-null  datetime64[ns]
 3   CustGender               1041614 non-null  object
 4   CustLocation             1041614 non-null  object
 5   CustAccountBalance       1041614 non-null  float64
 6   TransactionDate          1041614 non-null  datetime64[ns]
 7   TransactionTime          1041614 non-null  int64
 8   TransactionAmount (INR)  1041614 non-null  float64
dtypes: datetime64[ns](2), float64(2), int64(1), object(4)
memory usage: 79.5+ MB

In [127]:
df['CustomerAge'] = df['TransactionDate'].dt.year - df['CustomerDOB'].dt.year
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),CustomerAge
0,T1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,143207,25.0,22
1,T2,C2142763,2057-04-04,M,JHAJJAR,2270.69,2016-02-08,141858,27999.0,-41
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-02-08,142712,459.0,20
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,2016-02-08,142714,2060.0,43
4,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,2016-02-08,181156,1762.5,28

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1041614 entries, 0 to 1048566
Data columns (total 10 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   TransactionID            1041614 non-null  object
 1   CustomerID               1041614 non-null  object
 2   CustomerDOB              1041614 non-null  datetime64[ns]
 3   CustGender               1041614 non-null  object
 4   CustLocation             1041614 non-null  object
 5   CustAccountBalance       1041614 non-null  float64
 6   TransactionDate          1041614 non-null  datetime64[ns]
 7   TransactionTime          1041614 non-null  int64
 8   TransactionAmount (INR)  1041614 non-null  float64
 9   CustomerAge              1041614 non-null  int64
dtypes: datetime64[ns](2), float64(2), int64(2), object(4)
memory usage: 87.4+ MB

In [129]:
df['CustGender'].value_counts()

M    760978
F    280635
T         1
Name: CustGender, dtype: int64

In [130]:
df.drop(df[df['CustGender'] == 'T'].index, inplace=True)

## Manipulating locations

In [131]:
list(df['CustLocation'].unique())

['JAMSHEDPUR',
 'JHAJJAR',
 'MUMBAI',
 'NAVI MUMBAI',
 'ITANAGAR',
 'GURGAON',
 'MOHALI',
 'GUNTUR',
 'AHMEDABAD',
 'THANE',
 'PUNE',
 'NEW DELHI',
 'NO 3 KALYANI NAGAR PUNE',
 'SECUNDERABAD',
 'WAYS PANCHKUVA AHMEDABAD',
 'LUCKNOW',
 'DELHI',
 'CHENNAI',
 'GHAZIABAD',
 'BANGALORE',
 'GUWAHATI',
 'DHANBAD',
 'MUKTSAR',
 'SOCORRO',
 'ANDHERI (EAST) MUMBAI',
 'AURANGABAD',
 'KOTA',
 'JAIPUR',
 'K V RANGAREDDY',
 'MUZAFFARNAGAR',
 'BURDWAN',
 'LUDHIANA',
 'NOIDA',
 'AGRA',
 'SHAHJAHANPUR',
 'DIST RAIGAD PANVEL',
 'DEHRADUN',
 'HYDERABAD',
 'GODDA',
 'REWARI (HARYANA)',
 'NELLORE',
 'ADIPUR',
 'DUBAI',
 'ALLAHABAD',
 'BATHINDA',
 'NASHIK',
 'JAMMU',
 'JABALPUR',
 'KASHIPUR',
 'ETAH',
 'KOLKATA',
 'VADODARA',
 'TIRUPUR',
 'SURAT',
 'NAGO THANE',
 'KARUR DT',
 'CHITTO0R',
 'INDORE',
 'OFF CUBBON ROAD BANGALORE',
 'PIMPALI',
 'PUMP HINJEWADI PUNE',
 'KANJURMARG EAST',
 'SOUTH 24 PARGANAS',
 'MIRABHAYANDER THANE MIRA ROAD',
 'SAHARANPUR',
 'CHANDIGARH',
 'COMPLEX GURGAON',
 'PARK PHASE-I HINJEWADI PUNE',
 'GULBARGA',
 'KANPUR',
 'VISAKHAPATNAM',
 'HISAR',
 'FORT MUMBAI',
 'PATHANKOT',
 'SUNDARGARH',
 'MARGAO',
 'DHULE',
 'BANGALORE NORTH',
 'ZIRAKPUR',
 'SURYAPET',
 'BHIWANDI',
 'RAJKOT',
 'AMBEDKAR NAGAR',
 'PURI',
 'NAGAI DT',
 'KERALA',
 'GHINGHARTOLA TEH BAGESHWAR DIST',
 'ROURKELA',
 'MUPPALLA GUNTUR',
 'NEWDELHI',
 'PIPARIYA',
 'MIRA ROAD E',
 'BHUBANESHWAR',
 'RAJPURA',
 'PANCHKULA',
 'FARIDABAD',
 'JALANDHAR',
 'WEST MUMBAI',
 'GWALIOR',
 'SECTOR 21 KHARGHAR NAVI MUMBAI',
 'BAGHPAT',
 'AMBALA',
 'ZONE WHITEFIELD BANGALORE',
 'GORAKHPUR',
 'BARAMATI',
 'YAMUNANAGAR',
 'MANGALORE',
 'TALUK BANGALORE',
 'FIROZABAD',
 'PONDICHERRY',
 'RAIGAD',
 'BULANDSHAHR',
 'THRISSUR',
 'SONIPAT',
 'DEWAS',
 'AMBALA CANTT',
 'BILASPUR',
 'RAI SONEPAT',
 'JAUNPUR',
 'AMRITSAR',
 'RANGA REDDY',
 'HEADQUARTERS NAVI MUMBAI',
 'BADDI',
 'SRIPERUMBUDUR',
 'NAINITAL',
 'FATEHABAD',
 'BERHAMPUR',
 'NAGPUR',
 'MEERUT',
 'STATION BANGALORE',
 'BOKARO',
 'IRAGAVARAM',
 'SOLAPUR',
 'UDUPI',
 'BHUJ',
 'ROHTAK',
 'NAVIMUMBAI',
 'ARAKKONAM',
 'NIZAMABAD',
 'AHMEDNAGAR',
 'SILIGURI',
 'TIRUVALLUR',
 'SIVASAGAR',
 'NANDED',
 'VIRAR',
 'HOOGHLY',
 'THIRUVALLUR',
 'BENGALURU',
 'GARDEN CHOWK PIMPLE SAUDAGAR PUNE',
 'PANIPAT',
 'ALWAR',
 'RAIPUR',
 'KHERLI',
 'MADURAI',
 'ON KALYAN ROAD NAVI MUMBAI',
 'KALYANI NAGAR PUNE',
 'IDUKKI',
 'THOOTHUKUDI',
 'TALEGAON DABHADE',
 'BHILAI I',
 'KANPUR NAGAR',
 'PANVEL',
 'KHARSWAN JAMSHEDPUR',
 'SANGLI',
 'COLONY RANGAREDDI HYDERABAD',
 'ANDHERI W MUMBAI',
 'ULHASNAGAR-1 THANE',
 'TIRUPATI',
 'WARANGAL',
 'SANGALI',
 'MAHBOOBNAGAR',
 'ROORKEE',
 'BEHIND EXCOM HOUSE MUMBAI',
 'KARNAL',
 'ROPAR',
 'ALIGARH',
 'KOLLAM',
 'ANDHERI WEST MUMBAI',
 'SION (E) MUMBAI',
 'ROORKEE HARIDWAR',
 'TRIVANDRUM',
 'CUTTACK',
 'PALGHAR',
 'GANJAM',
 'THANJAVUR',
 'GADAG',
 'VIRUDHUNAGAR',
 'NORTH 24 PARGANAS',
 'KANNAD',
 'VELLORE',
 'ARIYALUR DISTRICT',
 'HATHRAS',
 'VARANASI',
 'CARANZALEM',
 'PATIALA',
 'KRISHNAGIRI',
 'SAS NAGAR',
 'SURATGARH',
 'VISAKHAPATANAM',
 'JAYANAGAR BANGALORE',
 'PERAMBALUR',
 'SAMRUDHDHI BHAVAN RAJKOT',
 'GUNTUR DIST',
 'CUDDALORE',
 'RANCHI',
 'COIMBATORE',
 'KHARDAH',
 'DISTT PUNE',
 'TIRUPATI (RURAL)',
 'JODHPUR',
 'MARKS SCHOOL NEW DELHI',
 'RAJAPALAYAM',
 'DOMBIVALI -WEST,THANE',
 'REWARI',
 'CINEMA HAORA',
 'VASAI',
 'MANALI',
 'KANCHIPURAM',
 'BHAVNAGAR',
 'SOLAN',
 'GURGAON RD DUNDHERA GURGAON',
 'SCHOOL BURDWAN',
 'HOWRAH',
 'MEDAK DIST',
 'INDIRANAGAR BANGALORE',
 'GAUTAM BUDDHA NAGAR',
 'DWARKA',
 'NURMAHAL',
 'KURLA ANDHERI RD MUMBAI',
 'KALYAN (W) THANE',
 'NEEMRANA',
 'UDAIPUR',
 'ALAPPUZHA',
 'DEORIA',
 'TANUKU',
 'SOUTH TWENTY FOUR PARAGANAS',
 'KALYAN W',
 'ERNAKULAM',
 'MATHURA',
 'DOMBIVLI',
 'PURBI SINGHBHUM',
 'PALI',
 'BANUR',
 'JAGATSINGHPUR',
 'SHIMLA',
 'PALAKKAD',
 'MORINDA MORINDA',
 'THANE W',
 'SINGHBHUM',
 'UTTARA KANNADA',
 'UNA',
 'HOBBLI BANGALORE',
 'JOGESHWARI (E) MUMBAI',
 'GANGTOK',
 'GREATER NOIDA',
 'NEVILLE HOUSE THANE',
 'RAI BARELI',
 'RAIGARH CG RAIGARH',
 'WRZESNIA',
 'MEWAT',
 'BOISAR',
 'BAMBOLIM',
 'KAPURTHALA',
 'TO B KAVERI TAILORS BANGALORE',
 'GHATKOPAR',
 'JALNA',
 'BLOCK KORAMANGALA BANGALORE',
 'AJMER',
 'KOTESHWARA',
 'DAMAN',
 'MANDI GOBINDGARH',
 'BAHADURGARH',
 'MANDI',
 'CHROMPET CHENNAI',
 'KALOL',
 'BELGAUM',
 'JALGAON',
 'MYSORE',
 'N M JOSHI MARG LOWER PAREL MUMBAI',
 'BHADRAK',
 'ARIYALUR DT',
 'VASAI THANE',
 'THIRUVARUR',
 'DARBHANGA',
 'TALUK KANCHEEPURAM DIST',
 'ASANSOL',
 'BHARUCH',
 'PRAKASAM',
 'GANDHINAGAR',
 'BULADHANA',
 'PONDA NORTH',
 'GHATKOPAR W MUMBAI',
 'JHUNJHUNU',
 'DOMBIVALI E',
 'SIKAR',
 'TANJAVUR',
 'KALYAN EAST',
 'ANDHERI (E) MUMBAI',
 'ANAND',
 'HARIDWAR',
 'NAGARI THANE',
 'YEOLA',
 'BARMER',
 'RAMNAGAR',
 'EAST DELHI',
 'PASCHIM MEDINIPUR',
 'VAPI',
 'KOTTAYAM',
 'ARIYALUR',
 'PATNA',
 'CHHINDWARA',
 'SIGNAL SION E MUMBAI',
 'BARAMATI PUNE BARAMATI',
 'AHMED NAGAR',
 'KHARGHAR',
 'BARODA',
 'RANGAREDDY DIST',
 'GOREGAON (W) MUMBAI',
 'CHOOLAIMEDU CHENNAI',
 'BHUBANESWAR',
 'NASIK',
 'VIZIANAGARAM',
 'HAZARIBAGH',
 'TRISHUR',
 'KALKA',
 'KOCHI',
 'RATIA',
 'SRIVILLIPUTTUR',
 'HUBLI',
 'KALYAN',
 'PATHANAMTHITTA',
 'NAGRI VASAI E THANE',
 'SHILLONG',
 'KALYANPUR DIST HARIDWAR ROORKEE',
 'ULHASNAGAR',
 'GHAZIPUR',
 'KANNIYAKUMARI',
 'SIVAGANGAI',
 'TIRUCHIRAPPALLI DT',
 'THANE DISTRICT',
 'HOSUR',
 'BG ROAD BANGALORE',
 'JALPAIGURI',
 'ATHAL',
 'DURG',
 'SILCHAR',
 'UNNAO',
 'KHANNA',
 'COLONY THANE EAST THANE',
 'BARGARH',
 'HOSPITAL BEHIND COIMBATORE',
 'THIRUVANNAMALAI',
 'LAYOUT PH 1 MALLATHAHALLI BANGALORE',
 'THANE WEST',
 'T MHALAUGE TEHSIL AMBEGAV PUNE',
 'SIDDHARTH NAGAR',
 'MARG KURLA W MUMBAI',
 'CHAMPARAN',
 'KOLAR',
 'CACHAR',
 'RESTAURANT JAIPUR',
 'BANGALURU',
 'KAITHAL',
 'THANE (W)',
 'KHARAGPUR',
 'RUDRAPUR',
 'KANGRA',
 'ANJAR GANDHIDHAM',
 'BHIWADI',
 'SURAT B/H PATEL SAMAJ VADI SURAT',
 'PARK MAHAPE NAVI MUMBAI',
 'MAHENDRA GARH',
 'JAMNAGAR',
 'JORHAT',
 'MANDYA',
 'SONEPAT',
 'KURNOOL DT',
 'THANE VIDYASHRAM THANE',
 'BANGLORE',
 'BALLIA',
 'HAJI ALI WORLI MUMBAI',
 'RAISEN',
 'KHEDA',
 'BAHADURGAR',
 'ROAD NASHIK',
 'MADIPAKKAM',
 'NAGAON',
 'ELPHINSTONE ROAD (W) MUMBAI',
 'DIST RAJKOT',
 'NALGONDA',
 'LATUR',
 'MAU',
 'PILANI',
 'SIRSA',
 'BARNALA',
 'BAREILLY',
 'ANDHERI (W) MUMBAI',
 'PAURI GARHWAL',
 'HIGH SCHOOL AURANGABAD',
 'KOZHIKODE',
 'KRISHNA DISTRICT',
 'BANGA',
 'STUD FARM PUNE',
 'JUNCTION CHENNAI',
 'R T NAGAR BANGALORE',
 'SALEM',
 'TRICHUR',
 'KRISHNA',
 'GAYA',
 'GOREGAON (E) MUMBAI',
 'SINDHUDURG - DISTRICT',
 'BANGALROE',
 'NAVSARI',
 'COLLEGE BANGALORE',
 'NADIA',
 'KHAMMAM',
 'BALARPUR MAINPURI',
 'BEED',
 'KATRA DISTT REASI',
 'UDHAMPUR',
 'NORTH WEST DELHI',
 'PRATAPGARH',
 'BHIND',
 'KHAMMAM (ANDHRA PRADESH)',
 'HAMIRPUR',
 'KHAR WEST MUMBAI',
 'BALASORE',
 'KOLKATA NEAR COLLEGE MORE KOLKATA',
 'MIDNAPORE',
 'BHIWANI',
 'MODINAGAR',
 'JAISINGHPUR',
 'CHOWK PUNE-MUMBAI HIGHWAY PUNE',
 'NORTH GOA',
 'VIDISHA',
 'PETA VIJAYAWADA',
 'SCHOOL PUNE',
 'RD SAKINAKA MUMBAI',
 'BIHARSHARIF',
 'NOIDA SEC 77',
 'BHANDARA',
 'JAGADHRI',
 'ANDHERI LINK RD ANDHERI W MUMBAI',
 'KANCHEEPURAM',
 'BARIATU ROAD RANCHI RANCHI',
 'ST THOMAS TOWN POST BANGALORE',
 'RAIGARH (CHHATTISGARH)',
 'PARVATIPURAM',
 'CHANDANNAGAR HAVELI PUNE',
 'EAST GODAVARI',
 'JOGESHWARI PURV MUMBAI',
 'DHARUHERA',
 'KARIMNAGAR',
 'CHUNABHATTI DEPO AND STN MUMBAI',
 'AL KHOBAR',
 'ANKLESHWAR',
 'SAVEDI AHMEDNAGAR',
 'CHEENAI',
 'NAME EAST KHASI HILLS SHILLONG',
 'TALEIGAD',
 'MILLENNIUM BANGALORE',
 'GARDEN MUMBAI',
 'MORADABAD',
 'CITY CHINCHWAD EAST PUNE',
 'HAPUR',
 'BHANDARKAR MARG LOWER PAREL MUMBAI',
 'BARDEZ',
 'LONDON',
 'GHANSOLI',
 'PO BHADRAKALI',
 'BIKANER',
 'SALEM DT',
 'CHIPLUN',
 'ABOHAR (FEROZEPUR)',
 'SIWAN',
 'BHOPAL',
 'KURALI',
 'B/H SOMANI HOSPITAL JAIPUR',
 'SHINE PUBLIC SCHOOL FARIDABAD',
 'BARABANKI',
 'BAHADURGARH (HARYANA)',
 'PARWANOO',
 'GOPALGANJ',
 'TIRUCHENDUR TALUK',
 'YAMUNA NAGAR',
 'CHANDRA SEKHARAPURAM PRAKASAM',
 'THODAPUZHA',
 'RAJAHMUNDRY',
 'RALEIGH',
 'THANE MUMBAI',
 'THANE (WEST)',
 'RUPNAGAR',
 'DHENKANAL',
 'ROAD MUMBAI',
 'KHARAR',
 'SECTOR-21A FARIDABAD',
 'KANYAKUMARI',
 'SRINAGAR',
 'KODAMBAKKAM',
 'PARNER',
 'BHARATPUR',
 'MAHARASHTRA MUMBAI',
 'RA PURAM',
 'UTTARPARA',
 'VASHI NAVI MUMBAI',
 'RAMANATHAPURAM',
 'DURGAPUR',
 'SAKINAKA MUMBAI',
 'SHILLLONG',
 'TIRUPATI URBAN',
 'HOSHIARPUR',
 'KOLHAPUR',
 'MEHSANA',
 'BIJNOR',
 'J B NGR ANDHERI E MUMBAI',
 'KHAIRTHAL',
 'FAIZABAD',
 'ERODE',
 'ROAD FARIDABAD',
 'NEW DLEHI',
 'VJB UDYAN MUMBAI',
 'TRICHY',
 'DOMBIVALI  THANE',
 'ISNAPUR X ROAD PATANCHERU HYDERABAD',
 'GOBINDAPUR',
 'DIMAPUR',
 'PADHAR',
 'TALIPARAMBA',
 'UTTAR DINAJPUR',
 'KOHINOOR CITY MALL MUMBAI',
 'SINGAPORE',
 'PAREL MUMBAI',
 'UJJAIN',
 'RATNAGIRI',
 'BANDRA (E) MUMBAI',
 'BHUJKUTCH',
 'THANE -WEST',
 'NO 1 BANJARA HILLS HYDERABAD',
 'CHHAPRA',
 'SAFIDON',
 'DOMBIVALI EAST THANE',
 'RANGA REDDY SERILINGAMPALLY',
 'MALAPPURAM',
 'MEDAK',
 'DISTRICT BALAGHAT',
 'AMROHA',
 'CHIRAG MOTORS SION MUMBAI',
 'VIJAYAWADA',
 'NAWANSHAHR',
 'RD ANDHERI WEST MUMBAI',
 'OPP HDFC BANGALORE',
 'OSHIWARA ANDHERI WEST MUMBAI',
 'RAMPUR',
 'UNJHA',
 'VASAI BASEEIN ROAD VASAI THANE',
 'AMRELI',
 'HOSPITAL PUNE',
 'KHANUSA',
 'HINGOLI',
 'DURG - DISTRICT',
 'POLICE STATION BANGALORE',
 'SUKET',
 'PAREL (W) MUMBAI',
 'HIMATNAGAR',
 'PLAZA THANE',
 'DHURI',
 'SARJAPUR MN RD BANGALORE',
 'GHATKESAR',
 'DARJEELING',
 'WHARF RESTAURNT BANGALORE',
 'WHITEFIELD,BANGALORE',
 'TIRUVANNAMALAI',
 'AGARTALA',
 'NO 2 THANE WEST',
 'MAPUSA BARDEZ',
 'SRIKAKULAM',
 'CHHATTISGARH(RAIGARH)',
 'MOGA',
 'VISHNUNAGAR KALYAN THANE',
 'ASHISH HOTEL PANCHVATI AHMEDABAD',
 'AZAMGARH',
 'THIRUVANANTHAPURAM',
 'HOTEL NAVI MUMBAI',
 'SONITPUR',
 'BIDAR DIST KARNATAKA',
 'STATION CUTTACK',
 'WEST MIDNAPORE',
 'KUALA LAMPUR',
 'G B NAGAR',
 'MIRZAPUR',
 'NAGAR PUNE',
 'LIMITED BILASPUR',
 'DEESA',
 'PAONTA SAHIB',
 'FARIDKOT',
 'SANAND',
 'PUDUKOTTAI DT',
 'KARUR',
 'PALMS HOTEL MUMBAI',
 'MAHALAXMI MUMBAI',
 'MOOSAPET HYDERABAD',
 'PURULIYA',
 'GURDASPUR',
 'BAHADVR GARH',
 'HALOL',
 'VALSAD',
 'BULDANA',
 'MIDC MUMBAI',
 'TANAJI NAGAR MALAD E MUMBAI',
 'KHED',
 'CIVIL LINE NAGPUR',
 'KATRA',
 'TIRUVARUR',
 'ULHASNAGAR W THANE',
 'PATTIVEERANPATTI',
 'PANT NAGAR',
 'DUNGARPUR',
 'DOMBIVALI',
 'SHOWROOM GURGAON',
 'RAIGARH',
 'DOMBIVLI AST',
 'BAGALKOT',
 'ADILABAD',
 'UPPER SIANG',
 'PERUNGUDI CHENNAI',
 'BETIM BARDEZ',
 'KAIRA',
 'MUNDAGOD',
 'N DELHI',
 'MAHIM MUMBAI',
 'HIGH SCHOOL NAVI MUMBAI',
 'BANKURA',
 'KANNAUJ',
 'BUXAR',
 'NATHDWARA',
 'SUNDARPUR',
 'FEROZEPUR',
 'DOMBIVALI E THANE',
 'TAL DIST BHIND',
 'BHAYA SONPUR',
 'MASA BILIMORA',
 'BUDAUN',
 'CORPORATION BANK KOLKATA',
 'CHANDAULI',
 'SECUDERABAD',
 'PUDUKOTTAI',
 'PUDUCHERRY',
 'DEOGARH',
 'SCHOOL MUMBAI',
 'MOHINDERGARH',
 'PHARMACY THANE WEST THANE',
 'CUDDAPAH',
 'BHILAI',
 'NAWASHAHR',
 'SAHNEWAL',
 'SCHOOL ALIGARH',
 'DOIMUKH',
 'GANGANAGAR',
 'YAVATMAL',
 'PATAN (GUJARAT)',
 'MODI NAGAR',
 'UDHAM SINGH NAGAR',
 'BHATLURU',
 'HILLTOP NAGPUR',
 'PUDUCHRRY',
 'WEST CHAMPARAN',
 '9A MALLESHWARAM BANGALORE',
 'NALANDA',
 'SUBHASH MARG C SCHEME JAIPUR',
 'UPPERPALLY HYDERABAD',
 'ABU DHABI',
 'CANACOWA',
 'CITY PO BANGALORE',
 'GODAVARI',
 'RING ROAD VARTHUR HOBLI BANGALORE',
 'CHAMARAJANAGAR',
 'BHILWARA',
 'CHAKALA ANDHERI E MUMBAI',
 'PALGHAR THANE',
 'POWAI',
 'TOHANA FATEHABAD',
 'ANANTAPUR',
 'NEEM KA THANA',
 'WEST GODAVARI',
 'MAPUSA (GOA)',
 'PORVORIM',
 'KEONJHAR',
 'EAST THANE',
 'NEVILLE HOUSE MUMBAI',
 'BENGUSARAI',
 'RESAPUVANIPALEM VISAKHAPATNAM',
 'GUDIWADA',
 'KANDIVALI W MUMBAI',
 'LOKHANDWALA RESIDENCY WORLI MUMBAI',
 'RAMGARH',
 'PANTNAGAR',
 'OKHLA INDUSTRIAL ESTATE NEW DELHI',
 'ASPATAL ASHOK NAGAR MORADABAD',
 'SAHIB STREET BANGALORE',
 'NABHA (PUNJAB)',
 'SCHOOL COIMBATORE',
 'BUNGLOWS ANAND',
 'COOCHBEHAR',
 'VAGATOR',
 'BAIPAS JAIPUR',
 'GANESHKHIND PUNE',
 'BUILDING PUNE',
 'OXFORD SCHOOL MUMBAI',
 'DOMBIVALI WEST VISHNUNAGAR THANE',
 'ROAD BANGALORE',
 'OF MYSORE PUNE',
 'GATE BANGALORE',
 'AMRAVATI ROAD NAGPUR',
 'DEVANAHALLI BANGALORE',
 'DANDENONG',
 'ROAD ANDHERI WEST MUMBAI',
 'RAMABAI NAGAR',
 'CHITTOOR',
 'GANDHIDHAM KUTCH',
 'BIJPUR',
 'KURLA W',
 'SATAVNAGAR HADAPSAR PUNE',
 'IRANIWADI KANDIVALI (W) MUMBAI',
 'SANGRUR',
 'NANI DAMAN',
 'MALAD WEST MUMBAI',
 'SITAMARHI',
 'VARACHHA SURAT',
 'GOBI',
 'BARDOLI',
 'CHAMPARAN MOTIHARI',
 'GACHIBOWLI HYDERABAD',
 'AIZAWL',
 'DADAR WEST BHAWANI SHANKAR MUMBAI',
 'SIVAGANGAI DIST',
 'MOOSAPET MOOSAPET HYDERABAD',
 'RATLAM',
 'RAJAMUNDRY',
 'PARK PHASE 1 HINJEWADI PUNE',
 'IMPHAL',
 'MANARCADU',
 'JALORE',
 'G B ROAD THANE',
 'SIRMAUR',
 'SOUTH WEST DELHI',
 'SIBSAGAR',
 'NEYYATTINKARA THIRUVANANTHAPURAM',
 'SAHIBABAD',
 'BALLABGARH FARIDABAD',
 'RESTAURANT NEW DELHI',
 'BIRBHUM',
 'VILL TOWN CITY KALYAN THANE',
 'NAKA PUNE',
 'CANDOLIM',
 'BHOJPUR',
 'ANDHERI E MUMBAI',
 'JASPUR',
 'TAL DIST PALGHAR BOISAR',
 'LAXMINAGAR',
 'REWA',
 'KUNIYIL',
 'JHANSI',
 'RAJSAMAND',
 'VPO WAZIRABAD',
 'GHATKOPAR (W) MUMBAI',
 'JAM KHAMBHALIYA',
 'WORLI COLONY MUMBAI',
 'AREA MOHALI',
 'MUNNEKOLALA MARATHALLI BANGALORE',
 'BHINMAL',
 'MALOUT',
 'KURLA W MUMBAI',
 'KANNUR',
 'SALAI CHENNAI',
 'D MART KANJURMARG W MUMBAI',
 'PUNE SASWAD ROAD PUNE',
 'FATEHGARH SAHIB',
 'MUKERIAN',
 'NASIRABAD',
 'COOCH BEHAR',
 'SAUDAGAR PUNE',
 'GODHRA (GUJARAT)',
 'DIST NASHIK',
 'CENTRE BANKURA',
 'TARN TARAN',
 'MULUND',
 'MEHSANA I E',
 'BANDRA EAST MUMBAI',
 'CHIRALA',
 'JAHANABAD',
 'DAHOD',
 'ROAD BKC BANDRA (E) MUMBAI',
 'HASSAN',
 'PHASE-1 SOUTH DELHI',
 'BAWAL',
 'VARNASI',
 'JORHAT, ASSAM',
 'MAIN ROAD MAHADEVAPURA BANGALORE',
 'JACOB CIRCLE MUMBAI',
 'RAICHUR',
 'GURUKUL KUMAR SCHOOL KASA NGR SURAT',
 'AUNDH CAMP PUNE',
 'BEHROR',
 'ANANTNAG',
 'LOWER PAREL MUMBAI',
 'BANDRA W MUMBAI',
 'NARELA',
 'DEVAJI AND VIPPLAZA ZIRAKPUR',
 'SIDDHARTHNAGAR',
 'JIND',
 'SARAIKELA KHARSAWAN',
 'PO BOX 28483 DUBAI',
 'JAYANAGAR BANGALURU',
 'PONDA',
 'NARASARAOPET',
 'SCHOOL WEST TRIPURA',
 'ELPHINSTONE ROAD MUMBAI',
 'HADAPSAR PUNE CITY PUNE',
 '24  P G S (S)',
 'SIVAGANGA',
 'PIMPLE SAUDAGAR PUNE',
 'MHAPE NAVI MUMBAI',
 'U S NAGAR',
 'BUDDHA NAGAR NOIDA',
 'GAUTAM BUDHNAGAR',
 '24 PGNS NORTH',
 'MOTHERSON COMPANY FARIDABAD',
 'MORENA',
 'PANCHMAHALS',
 'NARIMAN POINT  MUMBAI',
 'CITY FEROZEPUR',
 'PALAMU',
 'W MUMBAI',
 '.',
 'BHAGALPUR',
 'GRTR MUMBAI MUMBAI',
 'VADAGAV SHINDE HAVELI PUNE',
 'TARAN',
 'KAKKANAD',
 'BALIKUDA',
 'FINANCE THIRUVANANTHAPURAM',
 'STORES MANGALORE',
 'DENA BANK RADHANPUR ROAD MEHSANA',
 'MAHENDRAGARH',
 'TIRUNELVELI',
 'DIST THANE',
 'PALLADAM',
 'BARIPADA',
 'NR AMITABH BUNGLOW MUMBAI',
 'JOUNK)DISTT PAURI GARHWAL RISHIKESH',
 'DOMBIVLI EAST THANE',
 'PETROL PUMP KOLKATA',
 'BANSWARA',
 'KATEMANIVALI KALYAN THANE',
 'GIRGAON MUMBAI',
 'MARKET SECUNDRABAD',
 'BELLARY',
 'GANDHIDHAM',
 'BANGALORE SOUTH BANGALORE',
 'DHARAMSHALA',
 'CHURU',
 'VIDHYABHAVAN SURAT',
 'HYDERABAD RANGAREDDI',
 'CHEEKA',
 'CHANDRAPUR DIST',
 'DIMAPUR, NAGALAND',
 'VILLUPURAM',
 'GOREGAO',
 'MARG LOWER PAREL MUMBAI',
 '21A FARIDABAD',
 'PATPARGANJ DELHI',
 'SOUTH DELHI DELHI',
 'NANDGAON',
 'KAIMUR',
 'KHOWAI',
 'KURUKSHETRA',
 'DONGARI GOREGAON WEST MUMBAI',
 'LIPPA',
 'KOTHANUR BANGALORE',
 'SARDHANA',
 'MEDINIPUR',
 'NIRMAL NAGAR BANDRA (E) S O MUMBAI',
 'PUKHURIA',
 'CALCUTTA',
 'ROAD SATELLITE AHMEDABAD',
 'TIRUNELVELI DT',
 'DIST-THANE',
 'WARDHA',
 'PURAPUZHA',
 'TEMPLE BENGALURU',
 'POLICE STATION KOLKATA',
 'EAST MUMBAI(SUBURBAN)',
 'BEGU ROAD SIRSA',
 'NALLASOPARA E',
 'TERMINAL 2 WADALA EAST MUMBAI',
 'FAZILKA',
 'BANASHANKARI II STAGE BANGALORE',
 'NAGAR BANGALORE',
 'SANGHA KOLKATA',
 'SATNA',
 'DIST DHANBAD',
 'RICHARDS TOWN BANGLORE',
 'HARDWAR',
 'DERABASSI',
 'SHAH ALAM',
 'N T PUNE',
 'HADPSAR I C PUNE',
 'AIZAWL, MIZORAM',
 'STUDIO ANDHERI W MUMBAI',
 'RACHI',
 'NAMAKKAL',
 'SARJAPUR MAIN RD BANGALORE',
 'AMBIKAPUR',
 'MAZHAVANTHANGAL VILLAGE',
 'KORBA',
 'BUS DEPOT MUMBAI',
 'ROAD TIRUPUR',
 'KATARGAM SURAT',
 'BARIATU ROAD RANCHI',
 'BHUBANESWER',
 'OFFICE MRA 62 H N  TRIVANDRUM',
 'VERNA',
 'TIRUCHIRAPALLY (TRICHY)',
 'MEDICAL CENTRE CHENNAI',
 'PERAMBALUR DT',
 'RAJASMAND',
 'TIRUCHIRAPALLI DT',
 'SILVASSA',
 'TADEPALLIGUDEM WEST GODAVARI',
 'DOMBIVLI W',
 'MUMBAI THANE',
 'RIYADH',
 'DHARWARD',
 'GOKULPUR',
 'HOSPITAL BANGALORE',
 'DAKSHINA KANNADA',
 'DEOPUR DHULE',
 'ANDHERI E B/H AKRUTI STAR MUMBAI',
 'KARSOG',
 'CHAMPAWAT',
 'EAST MUMBAI',
 'CHINCHWAD PUNE',
 'GONDIYA',
 'CENTER HYDERABAD',
 'KALAYAN W',
 'MADHURAI',
 '18 CTS 65 CHEMBUR MUMBAI',
 'ABUDHABI',
 'GURGOAN',
 'GATE NO 4 MUMBAI',
 'MALDA',
 'CUDDALORE(DT)',
 'MUSSOORIE',
 'MUNCHEN',
 'SEHORE',
 'SARAN',
 'ALAM ROZA AHMEDABAD',
 'VILLAGE UTTARAHALLI BANGALORE',
 'PEN',
 'COMMUNITY HALL HYDERABAD',
 'RLY STN NAVI MUMBAI',
 'STATION GURGAON',
 'KULLU',
 'PATHANKOT [PB]',
 '(W) MUMBAI',
 'KUVA WALI GALI GREATER NOIDA',
 'KAROL BAGH NEW DELHI DELHI',
 'CHHIBRAMAU',
 'MUNNAR',
 'JUNAGADH',
 'CHICOLNA MORMUGAO',
 'THANA',
 'SIGNAL SION (E) MUMBAI',
 'GONDA',
 'MUMBAI MUMBAI',
 'GOVT SCHOOL BENGALURU',
 'INSTITUTE BURDWAN',
 'MALLESWARAM WEST BANGALORE',
 'RANAPRATAP NAGAR NAGPUR',
 'LASHKAR CITY',
 'NEW GAJUWAKA VISAKHAPATNAM',
 'SAGWARA',
 'ROAD ANDHERI (W) MUMBAI',
 'KANPUR DEHAT',
 'KALAHANDI',
 'THANE THANE',
 'CHAMPHAI',
 'SAGAR',
 '24 PGS N',
 'NANGAL',
 'PALWAL',
 'USGAO',
 'JUBAILI IND CITY',
 'BHIMTAL',
 'JEWELLERS HYDERABAD',
 'MAPUSA',
 'BARDDHAMAN',
 'VILUPPURAM',
 'SBS NAGAR',
 'MARGAO SALCETE',
 ...]

pune, ahmedabad, MUMBAI, BANGALORE, DELHI, RAJKOT, THANE, CHENNAI, COIMBATORE, JAIPUR

In [132]:
df.replace(r'(.*HYDERABAD.*)','HYDERABAD',regex=True, inplace = True)
df.replace(r'(.*PUNE.*)','PUNE',regex=True, inplace = True)
df.replace(r'(.*AHMEDABAD.*)','AHMEDABAD',regex=True, inplace = True)
df.replace(r'(.*MUMBAI.*)','MUMBAI',regex=True, inplace = True)
df.replace(r'(.*BANGALORE.*)','BANGALORE',regex=True, inplace = True)
df.replace(r'(.*DELHI.*)','DELHI',regex=True, inplace = True)
df.replace(r'(.*RAJKOT.*)','RAJKOT',regex=True, inplace = True)
df.replace(r'(.*THANE.*)','THANE',regex=True, inplace = True)
df.replace(r'(.*CHENNAI.*)','CHENNAI',regex=True, inplace = True)
df.replace(r'(.*COIMBATORE.*)','COIMBATORE',regex=True, inplace = True)
df.replace(r'(.*JAIPUR.*)','JAIPUR',regex=True, inplace = True)
df.replace(r'(.*KOLKATA.*)','KOLKATA',regex=True, inplace = True)

In [133]:
df['CustLocation'].value_counts()

DELHI                             157192
MUMBAI                            133119
BANGALORE                          89160
GURGAON                            73594
NOIDA                              32656
                                   ...
PRABHANI                               1
NEAR SRIYA SQUARE BHUBANESHWAR         1
SHIMOGA  DIST                          1
PERTH                                  1
KARANJIA                               1
Name: CustLocation, Length: 5849, dtype: int64

In [134]:
df['CustLocation'].unique()

array(['JAMSHEDPUR', 'JHAJJAR', 'MUMBAI', ..., 'CUTTACK CUTTACK',
       'IRVINE', 'KARANJIA'], dtype=object)

In [135]:
cdf = df.drop(columns=['TransactionID', 'TransactionTime'])
cdf.to_csv('data/cleaned_data.csv', index=False)

In [136]:
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),CustomerAge
0,T1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,143207,25.0,22
1,T2,C2142763,2057-04-04,M,JHAJJAR,2270.69,2016-02-08,141858,27999.0,-41
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-02-08,142712,459.0,20
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,2016-02-08,142714,2060.0,43
4,T5,C9031234,1988-03-24,F,MUMBAI,6714.43,2016-02-08,181156,1762.5,28

## RFM Analysis

In [137]:
df['TransactionDate'].max()

Timestamp('2016-12-09 00:00:00')

In [138]:
df['TransactionDate1']=df['TransactionDate']

In [139]:
rfm_df = df.groupby('CustomerID').agg(
    {
        "TransactionDate1":"max",
        "TransactionID" : "count",
        "TransactionAmount (INR)" : "sum",
    }
)
rfm_df.reset_index()
rfm_df.head()

           TransactionDate1  TransactionID  TransactionAmount (INR)
CustomerID
C1010011         2016-09-26              2                   5106.0
C1010012         2016-08-14              1                   1499.0
C1010014         2016-07-08              2                   1455.0
C1010018         2016-09-15              1                     30.0
C1010024         2016-08-18              1                   5000.0

In [140]:
rfm_df.shape

(879357, 3)

In [141]:
rfm_df['Recency'] = df['TransactionDate'].max() - rfm_df['TransactionDate1']
rfm_df['Recency'] = rfm_df['Recency'].dt.days
rfm_df.drop('TransactionDate1', axis=1, inplace=True)
rfm_df.columns = ['Frequency', 'Monetary', 'Recency']
rfm_df.head()

            Frequency  Monetary  Recency
CustomerID
C1010011            2    5106.0       74
C1010012            1    1499.0      117
C1010014            2    1455.0      154
C1010018            1      30.0       85
C1010024            1    5000.0      113

In [142]:
rfm_df['r_quartile'] = pd.qcut(rfm_df['Recency'], 5, [5, 4, 3, 2, 1])
rfm_df['m_quartile'] = pd.qcut(rfm_df['Monetary'], 5, [1, 2, 3, 4, 5])
rfm_df

            Frequency  Monetary  Recency r_quartile m_quartile
CustomerID
C1010011            2    5106.0       74          5          5
C1010012            1    1499.0      117          2          4
C1010014            2    1455.0      154          2          4
C1010018            1      30.0       85          4          1
C1010024            1    5000.0      113          3          5
...               ...       ...      ...        ...        ...
C9099836            1     691.0      154          2          3
C9099877            1     222.0       85          4          2
C9099919            1     126.0      113          3          1
C9099941            1      50.0      103          4          1
C9099956            1     855.0       75          5          4

[879357 rows x 5 columns]

In [143]:
rfm_df['rfm_score'] = rfm_df.r_quartile.astype(str)+ rfm_df.Frequency.astype(str) + rfm_df.m_quartile.astype(str)
rfm_df['rfm_score'] = rfm_df['rfm_score'].astype(int)
rfm_df.head()

            Frequency  Monetary  Recency r_quartile m_quartile  rfm_score
CustomerID
C1010011            2    5106.0       74          5          5        525
C1010012            1    1499.0      117          2          4        214
C1010014            2    1455.0      154          2          4        224
C1010018            1      30.0       85          4          1        411
C1010024            1    5000.0      113          3          5        315

### Most Valuable Customers

In [144]:
rfm_df.sort_values('rfm_score', ascending=False)[rfm_df['rfm_score'] >= 444]

            Frequency  Monetary  Recency r_quartile m_quartile  rfm_score
CustomerID
C5418253            6   5722.78        1          5          5        565
C6222360            6   5825.00        0          5          5        565
C4513786            6  12800.00       61          5          5        565
C6735477            6   2504.00        0          5          5        565
C7537344            6  21597.50        0          5          5        565
...               ...       ...      ...        ...        ...        ...
C8226373            4   1023.00      100          4          4        444
C4329946            4    920.00       91          4          4        444
C3418025            4   1241.00      101          4          4        444
C6140684            4   1362.00       91          4          4        444
C8123260            4    938.00       86          4          4        444

[189668 rows x 6 columns]

# Location wise analysis

1. age
2. gender
3. transaction volume
4. transaction frequency

In [145]:
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),CustomerAge,TransactionDate1
0,T1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,143207,25.0,22,2016-02-08
1,T2,C2142763,2057-04-04,M,JHAJJAR,2270.69,2016-02-08,141858,27999.0,-41,2016-02-08
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-02-08,142712,459.0,20,2016-02-08
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,2016-02-08,142714,2060.0,43,2016-02-08
4,T5,C9031234,1988-03-24,F,MUMBAI,6714.43,2016-02-08,181156,1762.5,28,2016-02-08

In [146]:
df.drop(columns=['CustomerDOB', 'TransactionDate1'], inplace=True)
df.head()

,TransactionID,CustomerID,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),CustomerAge
0,T1,C5841053,F,JAMSHEDPUR,17819.05,2016-02-08,143207,25.0,22
1,T2,C2142763,M,JHAJJAR,2270.69,2016-02-08,141858,27999.0,-41
2,T3,C4417068,F,MUMBAI,17874.44,2016-02-08,142712,459.0,20
3,T4,C5342380,F,MUMBAI,866503.21,2016-02-08,142714,2060.0,43
4,T5,C9031234,F,MUMBAI,6714.43,2016-02-08,181156,1762.5,28

In [147]:
df['CustLocation'].unique()

array(['JAMSHEDPUR', 'JHAJJAR', 'MUMBAI', ..., 'CUTTACK CUTTACK',
       'IRVINE', 'KARANJIA'], dtype=object)

In [148]:
df['T1'] = df['TransactionAmount (INR)']

In [149]:
loc_df = df.groupby('CustLocation').agg(
    {
        'CustomerAge': 'mean',
        'TransactionAmount (INR)': 'mean',
        'T1': 'count'
    }
)
loc_df.reset_index()
loc_df

                                     CustomerAge  TransactionAmount (INR)  T1
CustLocation
(154) BHASKOLA FARIDABAD               23.000000               540.031818  11
(DT) HOSUR                             28.181818              1398.191818  11
(INDIA ) NAGPUR                        30.000000              3242.025000   8
(METRO) NR RAM MANDIR KAMRUP(METRO)    26.000000               495.500000   2
(MOHALI) KHARAR                       -42.769231               608.424615  13
...                                          ...                      ...  ..
ZIRAKPUR ZIRAKPUR                     216.000000               692.250000   8
ZIRKPUR                                41.000000               821.000000  10
ZUARINAGAR                             25.000000              1014.810000   6
ZUMARI TILAIYA                         27.000000               938.891111   9
ZUNHEBOTO                              24.000000              3756.000000   1

[5849 rows x 3 columns]